# GetFace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..GetFace Method
Edge Class See Also
---
Returns one of the two faces that meet at the edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Face GetFace(
	int index
)
```

Visual Basic
---
```text
Public Function GetFace ( _
	index As Integer _
) As Face
```

Visual C++
---
```text
public:
Face^ GetFace(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32The index of the face (0 or 1).
# See Also
Edge Class
Autodesk.Revit.DB Namespace